code/app/controllers/companies_controller.rb

SELECT * FROM "companies" WHERE ("companies"."id" = 1)
---
  def show
    @company = Company.find(params[:id])

INSERT INTO "companies" ("name") VALUES('GVT')
---
  def create
    @company = Company.new(params[:company])

    respond_to do |format|
      if @company.save