code/app/controllers/incomes_controller.rb

  def show
    @income = Income.find(params[:id])
---
SELECT * FROM "incomes" WHERE ("incomes"."id" = 1)

  def create
    @income = Income.new(params[:income])
	@income.date = params[:income][:date]+"-01"

    respond_to do |format|
      if @income.save
---
INSERT INTO "incomes" ("created_at", "updated_at", "date", "value", "company_id", "description") VALUES('2010-02-27 05:47:03', '2010-02-27 05:47:03', NULL, 1000, NULL, 'Salario Leonardo')