code/app/controllers/montly_details_controller.rb

  def index
	date_now = Time.now.strftime('%Y%m')
	printf "%s", date_now
    @outcomes = Outcome.find :all, :joins => [:subcategory, :company], :order => "data_vencimento",
		:conditions => "strftime('%Y%m', outcomes.data_vencimento) = strftime('%Y%m', 'now') or
---
SELECT "outcomes".* FROM "outcomes" INNER JOIN "subcategories" ON "subcategories".id = "outcomes".subcategory_id INNER JOIN "companies" ON "companies".id = "outcomes".company_id WHERE (strftime('%Y%m', outcomes.data_vencimento) = strftime('%Y%m', 'now') or
SELECT * FROM "categories" WHERE ("categories"."id" = 1)
SELECT * FROM "companies" WHERE ("companies"."id" = 1)
SELECT * FROM "subcategories" WHERE ("subcategories"."id" = 1)