code/app/controllers/outcome_plannings_controller.rb

SELECT "outcome_plannings".* FROM "outcome_plannings" INNER JOIN "subcategories" ON "subcategories".id = "outcome_plannings".subcategory_id GROUP BY category_id
---
  def index
    @outcome_plannings = OutcomePlanning.all(:joins => :subcategory)

SELECT * FROM "outcome_plannings" WHERE ("outcome_plannings"."id" = 1)
---
  def show
    @outcome_planning = OutcomePlanning.find(params[:id])

SELECT * FROM "outcome_plannings" WHERE ("outcome_plannings"."id" = 1)
---
  def edit
    @outcome_planning = OutcomePlanning.find(params[:id])

INSERT INTO "outcome_plannings" ("created_at", "updated_at", "value", "plan_for_date", "description", "subcategory_id") VALUES('2010-03-01 02:01:23', '2010-03-01 02:01:23', 100.0, NULL, 'Ração das cacchoras', NULL)
---
  def create
    @outcome_planning = OutcomePlanning.new(params[:outcome_planning])
    @outcome_planning.plan_for_date = params[:outcome_planning][:plan_for_date]+"-01"

    respond_to do |format|
      if @outcome_planning.save