code/app/controllers/outcomes_controller.rb

  def show
    @outcome = Outcome.find(params[:id], :joins => [:subcategory, :company])
---
SELECT * FROM "outcomes" WHERE ("outcomes"."id" = 1)

  def edit
    @outcome = Outcome.find(params[:id])
---
SELECT * FROM "outcomes" WHERE ("outcomes"."id" = 3)

  def create
    @outcome = Outcome.new(params[:outcome])

    respond_to do |format|
      if @outcome.save
---
INSERT INTO "outcomes" ("data_vencimento", "created_at", "updated_at", "data_pagamento", "value", "company_id", "description", "subcategory_id") VALUES(NULL, '2010-02-27 03:16:47', '2010-02-27 03:16:47', NULL, 1, NULL, 'teste', NULL)

  def update
    @outcome = Outcome.find(params[:id])

    respond_to do |format|
      if @outcome.update_attributes(params[:outcome])
---
SELECT * FROM "outcomes" WHERE ("outcomes"."id" = 3)
UPDATE "outcomes" SET "updated_at" = '2010-03-01 00:23:29', "data_vencimento" = '2010-03-02', "data_pagamento" = '2010-03-02' WHERE "id" = 1